app/validators/location_id_validator.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def validate(record)
        if record.location_id
            location = Location.find_by_id(record.location_id)