app/validators/maximum_capacity_validator.rb

    def validate(record)
        if record.location_id && record.maximum_capacity
            location = Location.find_by_id(record.location_id)
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]