app/validators/user_id_validator.rb

    def validate(record)
        event = Event.find_by_id(record.event_id)
        user = User.find_by_id(record.user_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]