app/views/events/_form.html.erb

SELECT "locations".* FROM "locations"
---
<%= f.label "Event Location:" %>
<%= f.collection_radio_buttons(:location_id, Location.all, :id, :name) do |b|%>