app/controllers/application_controller.rb

    def current_user
        User.find_by_id(session[:user_id]) || Producer.find_by_id(session[:producer_id])
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]