app/controllers/events_controller.rb

    def search
        # make this case insensitive
        event = Event.find_by(:name => params[:event_name])
---
SELECT "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]

    def set_event
        @event = Event.find_by_id(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]