app/controllers/events_controller.rb

INSERT INTO "events" ("producer_id", "location_id", "name", "start_date", "end_date", "price", "image_url", "maximum_capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @event = Event.new(event_params)

        set_dates

        if @event.save

SELECT "events".* FROM "events" WHERE "events"."location_id" = ? AND (start_date > '2020-10-09 13:01:55.336023')  [["location_id", 4]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."producer_id" = ? AND (start_date > '2020-10-04 12:36:30.676431')  [["producer_id", 2]]
SELECT "producers".* FROM "producers" WHERE "producers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "rsvps" ON "events"."id" = "rsvps"."event_id" WHERE "rsvps"."user_id" = ? AND (start_date > '2020-10-04 12:14:31.958347')  [["user_id", 5]]
SELECT "producers".* FROM "producers" WHERE "producers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def index
        if params[:location_id]
            @events = Location.find_by_id(params[:location_id]).events
        elsif params[:producer_id]
            @events = Producer.find_by_id(params[:producer_id]).events
        elsif params[:user_id]
            user = User.find_by_id(params[:user_id])
            @events = user.events

            if params[:status] == "attending"
                @events = user.events_attending
            elsif params[:status] == "waiting"
                @events = user.events_waiting
            end
        else
            @events = Event.all

SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."event_id" = ? AND "rsvps"."user_id" = ? LIMIT ?  [["event_id", 4], ["user_id", 5], ["LIMIT", 1]]
---
    def show
        if !@event
            flash[:message] = "Sorry, that event cannot be found."
            redirect_to events_path
        else
            @rsvp = Rsvp.find_or_initialize_by(:event_id => @event.id, :user_id => current_user.id)

UPDATE "events" SET "start_date" = ?, "end_date" = ?, "location_id" = ?, "maximum_capacity" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_date", "2020-10-09 15:01:00"], ["end_date", "2020-10-09 16:01:00"], ["location_id", 4], ["maximum_capacity", 2], ["updated_at", "2020-10-09 13:01:32.998685"], ["id", 9]]
---
    def update
        reset_dates
        set_dates

        if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_event
        @event = Event.find_by_id(params[:id])