app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "address", "maximum_capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My Home"], ["address", "My Home, London, UK"], ["maximum_capacity", 5], ["created_at", "2020-10-09 13:01:18.932547"], ["updated_at", "2020-10-09 13:01:18.932547"]]
---
    def create
        @location = Location.new(location_params)

        if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_location
        @location = Location.find_by_id(params[:id])