app/controllers/producers_controller.rb

    def create
        @producer = Producer.new(producer_params)

        if @producer.save
---
INSERT INTO "producers" ("email", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def index
        @producers = Producer.all
---
SELECT "producers".* FROM "producers"

    def update
        if @producer.update(producer_params)
---
UPDATE "producers" SET "first_name" = ?, "last_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "producers"."id" = ?  [["first_name", "Bradd"], ["last_name", "Pitt "], ["password_digest", "$2a$12$l1i6QvvwxFyNmLb4hxsG3eCTLvq9XnsDEMb7PLzwFZcSnYjVjLq/O"], ["updated_at", "2020-10-10 10:05:08.690772"], ["id", 5]]

    def destroy
        @producer.destroy
        @producer.events.destroy_all
---
DELETE FROM "producers" WHERE "producers"."id" = ?  [["id", 3]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 8]]

    def set_producer
        @producer = Producer.find_by_id(params[:id])
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]