app/controllers/rsvps_controller.rb

    def create
        binding.pry
        #check this status = nil thing. Is this still setting as soon as the user visits the page?
        # rsvp = Rsvp.new(:user_id => current_user.id, :event_id => params[:rsvp][:event_id], :status => nil)
        rsvp = Rsvp.new(rsvp_params)
        @event = Event.find_by_id(params[:rsvp][:event_id])
        @user = User.find_by_id(params[:rsvp][:user_id])

        if rsvp.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "rsvps" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["event_id", 4], ["created_at", "2020-10-04 12:14:29.505641"], ["updated_at", "2020-10-04 12:14:29.505641"]]

    def destroy
        Rsvp.find_by_id(params[:id]).destroy
---
DELETE FROM "rsvps" WHERE "rsvps"."id" = ?  [["id", 3]]
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]