app/controllers/sessions_controller.rb

    def create
        if params[:producer]
            account_holder = Producer.find_by(:email => params[:email])
        else
            account_holder = User.find_by(:email => params[:email])
---
SELECT "producers".* FROM "producers" WHERE "producers"."email" = ? LIMIT ?  [["email", "jtesori"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "canthony@gmail.com"], ["LIMIT", 1]]