app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def index
        if params[:event_id]
            @event = Event.find_by_id(params[:event_id])
            @users = @event.users

            if params[:filter] == "attending"
                @users = @event.attending_users
            elsif params[:filter] == "waiting"
                @users = @event.waiting_users
            end
        else
            @users = User.all
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "rsvps" ON "users"."id" = "rsvps"."user_id" WHERE "rsvps"."event_id" = ?  [["event_id", 4]]

    def update
        @user = current_user

        if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$NMzOhxlYXYNBJdTbzXLLCOOyPOz1IfL9eC9ERsKwCMTFlqA7SUd62"], ["updated_at", "2020-10-04 11:50:52.485116"], ["id", 5]]