app/models/event.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def attending_users
        self.rsvps.attending.collect { |rsvp| User.find_by_id(rsvp.user_id) }

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3338716509554912], ["LIMIT", 1]]
---
    def waiting_users
        self.rsvps.waiting.collect { |rsvp| User.find_by_id(rsvp.user_id) }