app/models/user.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def events_attending
        self.rsvps.attending.collect { |rsvp| Event.find_by_id(rsvp.event_id) }

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def events_waiting_for
        self.rsvps.waiting.collect { |rsvp| Event.find_by_id(rsvp.event_id) }

INSERT INTO "users" ("id", "first_name", "last_name", "email", "password_digest", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "jessgnphotography@gmail.com"], ["LIMIT", 1]]
---
    def self.from_omniauth(auth)
        where(email: auth["info"]["email"]).first_or_create do |user|